In [1]:
#import libraries
import pandas as pd
import numpy as np
import os

In [3]:
#create path variable
path=r'C:\Users\37mhu\Documents\Instacart Basket Analysis'

In [9]:
#import datasets
df_prods=pd.read_csv(os.path.join(path,'02 Data','Original Data', 'products.csv'),index_col=False)

In [119]:
df_ords=pd.read_csv(os.path.join(path,'02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col=False)

In [15]:
#create dataframe
df_test=pd.DataFrame()

In [17]:
#create mixed type column
df_test['mix']=['a', 'b', 1, True]

In [19]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [23]:
#check for mixed types
for col in df_test.columns.tolist():
    weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis=1)
    if len (df_test[weird])>0:
        print(col)

mix

In [25]:
df_test['mix']=df_test['mix'].astype('str')

In [27]:
#check for null values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [29]:
#create df for nulls
df_nan=df_prods[df_prods['product_name'].isnull()==True]

In [31]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [33]:
#check shape of df prods
df_prods.shape

(49693, 5)

In [35]:
#remove nulls from prods
df_prods_clean=df_prods[df_prods['product_name'].isnull()==False]

In [37]:
#check shape of df prods clean
df_prods_clean.shape

(49677, 5)

In [39]:
#copy duplicates from df prods to df dupes
df_dupes=df_prods_clean[df_prods_clean.duplicated()]

In [41]:
df_dupes

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [43]:
#check shape of df prods clean
df_prods_clean.shape

(49677, 5)

In [45]:
#remove dupes from df prods clean
df_prods_clean_nodupes=df_prods_clean.drop_duplicates()

In [47]:
#check shape of df prods clean nopdupes
df_prods_clean_nodupes.shape

(49672, 5)

In [49]:
#export df prods clean nodupes to csv file
df_prods_clean_nodupes.to_csv(os.path.join(path,'02 Data','Prepared Data','products_checked.csv'))

In [51]:
#TASK STEPS

In [97]:
#2 The # of records for the days_since_prior_order column is lower than expected
df_ords.describe().apply(lambda s: s.apply('{0:.5f}'.format))

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,hour_order_placed,days_since_prior_order
count,3421083.00000,3421083.00000,3421083.00000,3421083.00000,3421083.00000,3421083.00000,3214874.00000
mean,1710541.00000,1710542.00000,102978.20806,17.15486,2.77622,13.45202,11.11484
std,987581.73983,987581.73982,59533.71779,17.73316,2.04683,4.22609,9.20674
min,0.00000,1.00000,1.00000,1.00000,0.00000,0.00000,0.00000
25%,855270.50000,855271.50000,51394.00000,5.00000,1.00000,10.00000,4.00000
50%,1710541.00000,1710542.00000,102689.00000,11.00000,3.00000,13.00000,7.00000
75%,2565811.50000,2565812.50000,154385.00000,23.00000,5.00000,16.00000,15.00000
max,3421082.00000,3421083.00000,206209.00000,100.00000,6.00000,23.00000,30.00000

In [65]:
#3
for col in df_ords.columns.tolist():
    weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis=1)
    if len (df_ords[weird])>0:
        print(col)

In [67]:
#4 there were no mixed data columns found

In [121]:
#5 The only missing values were from the days since prior order column. This could mean that the order was the first order that customer placed.
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
hour_order_placed              0
days_since_prior_order    206209
dtype: int64

In [85]:
df_ords_nullprior=df_ords[df_ords['days_since_prior_order'].isnull()==True]

In [123]:
df_ords_nullprior.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,hour_order_placed,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN

In [113]:
#6 I did not update the missing values as they indicate that the order was the first order placed

In [81]:
#7 There were no duplicate rows
df_ords[df_ords.duplicated()]

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, hour_order_placed, days_since_prior_order]
Index: []

In [83]:
#8 There were no duplicate rows in df ords

In [125]:
#Export dfs to csv
df_ords.to_csv(os.path.join(path,'02 Data','Prepared Data','orders_prepared.csv'))

In [117]:
df_prods.to_csv(os.path.join(path,'02 Data','Prepared Data','products_prepared.csv'))